Revit 2027 API
UIApplication.PostCommand Method
 Posts the command to the Revit message queue to be invoked when control returns from the current API context.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PostCommand(
	RevitCommandId commandId
)
Public Sub PostCommand (
	commandId As RevitCommandId
)
public:
void PostCommand(
	RevitCommandId^ commandId
)
member PostCommand :
        commandId : RevitCommandId -> unit
Parameters
commandId RevitCommandId
 The command Id.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when commandId is null.
ArgumentException | If the command cannot be posted.
InvalidOperationException |  If there is a command already been posted.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace